design.tex
% Created 2016-10-27 tor 07:16
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{owickstrom}
\date{\today}
\title{Middlewarez}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Design}
\label{sec-1}

\subsection{Connection}
\label{sec-1-1}

A connection models the entirety of a connection between the HTTP server and
the user agent - both request and response. This design is adopted from \emph{Plug},
an abstract HTTP interface in Elixir, that enables various HTTP libraries to
inter-operate.


\section{Use Cases}
\label{sec-2}

\subsection{Writing a Full Response}
\label{sec-2-1}

A function which writes a complete response could take a connection with an
empty response.

\begin{verbatim}
class ResponseWriter w where
  writeResponse :: String
                -> w
                -> Conn { response :: Complete }

instance ∀ r. ResponseWriter (Conn { response :: Empty } | r) where
  writeResponse r conn = ...
\end{verbatim}

\subsection{Writing a Partial Response}
\label{sec-2-2}

A function which writes a partial response could take a connection of either an
empty or a partial response.

\begin{verbatim}
class PartialWriter w where
  writePartial :: String
               -> w
               -> Conn { response :: Partial }
\end{verbatim}

\subsection{Parsing the Request Body}
\label{sec-2-3}

The request body is a stream in the connection. It might not always be
of interest, thus it is not read, and not parsed, by default. Instead,
the user explicitly chooses to read and parse the body with a given
parser, which returns a new connection of a type reflecting this
change.

\begin{verbatim}
class BodyParser t p where
  parse ∷ ∀ r. Conn { bodyStream ∷ Stream Unconsumed | r }
          → Conn { bodyStream ∷ Stream Consumed, body ∷ t | r }

instance BodyParser Form HttpFormParamsParser where
  parse conn = ...
\end{verbatim}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
